<a href="https://colab.research.google.com/github/riznazzahraF-create/Modul-Basis-Data/blob/main/BAB%204%20-%20modul%20basis%20data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **BAB 4 - ALTER, MODIFY, DROP, RENAME (DDL)**


---


## **4.2 Test Awal**
###1. Contoh perintah Alter dan Modify dalam satu sintaks
<pre>
<code class="language-sql">
ALTER TABLE siswa
MODIFY nama_siswa VARCHAR(100);
</code>
</pre>

###2. Contoh penggunaan drop table
<pre>
<code class="language-sql">
DROP TABLE siswa;
</code>
</pre>


###3. Contoh penerapan rename table
<pre>
<code class="language-sql">
 RENAME TABLE
    siswa TO data_siswa,
    guru TO data_guru,
    kelas TO data_kelas;
</code>
</pre>

---

##**4.3.1 Merubah Struktur Table**
Ada empat macam perubahan yang dapat dilakukan terhadap struktur tabel, yaitu : <br>
###**1. Perubahan terhadap nama field/kolom <br>**
- Perintahnya : <br>
<pre>
<code class="language-sql">
 Alter Table Nama_Table Change Nama_Field_Lama
 Nama_Field_Baru Tipe_Data (Size);
</code>
</pre>
- Contoh : <br>
<pre>
<code class="language-sql">
mysql > Alter Table Mahasiswa
Change Nama Nama_Mhs Char (40);
</code>
</pre>

###**2. Perubahan terhadap tipe data** <br>
- Perintahnya :
<pre>
<code class="language-sql">
Alter Table Nama_Table
Modify Nama_Field Tipe_Data_Baru (Size);
</code>
</pre>
- Contoh :
<pre>
<code class="language-sql">
mysql > Alter Table Mahasiswa
Modify NIM Char (8);
</code>
</pre>

###**3. Penambahan field**

- Perintahnya :
<pre>
<code class="language-sql">   
Alter Table Nama_Table
Add Nama_Field_Baru Tipe_Data (Size);
</code>
</pre>
- Contoh :
<pre>
<code class="language-sql">
mysql > Alter Table Mahasiswa
Add Fakultas Varchar(30);
</code>
</pre>

###**4. Penghapusan field**
- Perintahnya :
<pre>
<code class="language-sql">
Alter Table Nama_Table
Drop Column Nama_Field;
</code>
</pre>

- Contoh :
<pre>
<code class="language-sql">
mysql > Alter Table Mahasiswa
Drop Column Fakultas;
</code>
</pre>

---

##**4. Drop (menghapus table)**
- Perintahnya :
<pre>
<code class="language-sql">
Drop Table Nama_Table;
</code>
</pre>

- Contoh :
<pre>
<code class="language-sql">
mysql > Drop Table Mhs;
</code>
</pre>